int f[MAXM];
void find_f (string& s) {
    int m=s.size();
    f[0]=0;
    for (int i=1; i<m; i++) {
        int pos=i-1; /// позицията, до която сме стигнали
        while (pos>=0) {
            int l=f[pos];
            if (s[l]==s[i]) {
                f[i]=l+1;
                break;
            }
            pos=l-1; /// връщаме позицията на $l-1$ и съответния префикс ще е с дължина $f(l-1)$
        }
        if (pos<0) f[i]=0; /// не сме срещнали равенство и това означава, че най-дългият добър суфикс е празният
    }
}
